In [3]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
imdb = pd.read_csv("IMDB-database-update.csv", encoding='latin1')

In [5]:
#imdb[["movie_facebook"]] = imdb[["movie_facebook"]].astype('str')

In [6]:
imdb.isnull().sum()

movie_ID                     0
movie_title                  0
duration                     0
color                        0
title_year                   0
country                      0
language                     0
content_rating               0
budget_USD                   0
gross_USD                    0
net_USD                      0
profitable                   0
director_name                0
director_top20?              0
director_facebook?           0
director_facebook_likes      0
actor_1_name                 0
actor_top20?                 0
actor_1_facebook?            0
actor_1_facebook_likes       0
actor_2_name                 0
actor_top20?.1               0
actor_2_facebook?            0
actor_2_facebook_likes       0
actor_3_name                 0
actor_top20?.2               0
actor_3_facebook?            0
actor_3_facebook_likes       0
cast_total_facebook_likes    0
movie_facebook?              0
movie_facebook_likes;        0
facenumber_in_poster         0
num_voted_users              0
num_user_for_reviews         0
imdb_score                   0
imdb_top_250                 0
dtype: int64

In [8]:
imdb = imdb.drop_duplicates()

In [9]:
imdb[["duration","gross_USD"]].describe()

          duration     gross_USD
count  3781.000000  3.781000e+03
mean    109.950278  5.182002e+07
std      22.299267  7.003776e+07
min      37.000000  1.620000e+02
25%      95.000000  7.605668e+06
50%     106.000000  2.896520e+07
75%     120.000000  6.600997e+07
max     325.000000  7.605058e+08

#### 1. How many rows and columns reflected on dataset file

In [11]:
imdb.shape

(3781, 36)

#### 2. What are the top 3 movies with highest nett profit in 2013?

In [13]:
movie2013 = imdb[imdb['title_year']==2013]
datau_sort = movie2013.sort_values(by='net_USD', ascending=False)
datau_sort.head(3)[['movie_title','net_USD']]

                          movie_title    net_USD
1614  The Hunger Games: Catching Fire  294645577
236                   Despicable Me 2  292049635
57                             Frozen  250736600

#### 3. What are the top 3 movies with highest gross profit in 2009?

In [14]:
movie2009 = imdb[imdb['title_year']==2009]
datau_sort1 = movie2009.sort_values(by='gross_USD', ascending=False)
datau_sort1.head(3)[['movie_title','gross_USD']]

                                 movie_title  gross_USD
0                                     Avatar  760505847
19       Transformers: Revenge of the Fallen  402076689
3094  Harry Potter and the Half-Blood Prince  301956980

#### 4. How many non-english movies are in the dataset?

In [15]:
len(imdb[imdb['language']!='English'])

153

#### 5. What are top 3 languages in the dataset aside English (based on number of movies)?

In [17]:
imdb['language'].value_counts().head(3)

English    3628
French       33
Spanish      23
Name: language, dtype: int64

#### 6. What are the top 3 countries with the highest nett profit in all dataset times?

In [18]:
datagroup = imdb.groupby('country').net_USD.sum().reset_index()
data_sort = datagroup.sort_values(by='net_USD', ascending=False).reset_index()
data_sort.drop(columns='index').head(3)

     country      net_USD
0        USA  52003933174
1         UK   1531614524
2  Australia    252571616

#### 7. What are the average budget of all movies in dataset in 2013?

In [19]:
data_sort2 = imdb[imdb['title_year']==2013]
datauavg_group = data_sort2.groupby('title_year').budget_USD.mean().reset_index()
datauavg_group

   title_year    budget_USD
0        2013  5.106961e+07

#### 8. What are the average budget of all movies in dataset in 2014?

In [20]:
datau_sort3 = imdb[imdb['title_year']==2014]
datauavg_group1 = datau_sort3.groupby('title_year').budget_USD.mean().reset_index()
datauavg_group1

   title_year    budget_USD
0        2014  4.991901e+07

#### 9.  Which one is higher, average budget of all movies in dataset in 2014 or 2013?

In [21]:
np.max([np.mean(datauavg_group),
       np.mean(datauavg_group1)])

51069610.77439024

#### 10. What movie that resulted highest nett profit of all dataset times? How much did the movie make?

In [22]:
imdb[imdb['net_USD']==np.max(imdb['net_USD'])][['movie_title','net_USD']]

  movie_title    net_USD
0      Avatar  523505847